def n1():
    countries_dict = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин", "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                     "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава", "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",                     "Северная Македония": "Скопье", "Сербия": "Белград"}
    i=input("Введите страну: ")
    print("Столица страны: ", countries_dict[i])
    for key in sorted(countries_dict):
        print(key, "-", countries_dict[key])
n1()
def n2():
    slovo=input("Введите слово: ")
    s=0
    alp = {"авеинорст": 1, "дклмпу": 2,"бгёья": 3, "йы": 4,"жзхцч": 5, "шэю": 8,"фщъ": 10}
    for key in (alp):
        for i in slovo:
            if i.lower() in key:
                s += alp[key]

    print("Сумма вашего слова: ", s)
n2()
def n3():
    sp= {"Иванов" : "русский, английский" ,"Смирнов" : "французский,польский,немецкий","Кузнецов" : "китайский, греческий","Попов" : "английский,турецкий","Васильев": "китайский,шведский,итальянский"}
    s=0
    o=''
    g=''
    sum=0
    f = input("Введите фамилию: ")
    k=0
    for i in sp[f]:
        if i == ",":
            k +=1
    k = k+1
    print("Этот студент знает ", k, "языка")
    print("Эти языки: ", sp[f])
    for key in sp:
        if "китайский" in sp[key]:
            s +=1
        o += ','+ sp[key]
    print("Количество студентов, которые знают китайский: ", s)
    h=o.split(",")
    h=sorted(h)
    for i in h:
        if i not in g:
            g += i + ' '
            sum +=1
    print("Список языков, которые знают студенты: ", g)
    print("Количество языков: ",sum)
n3()